params_servientrega.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://tempuri.org/">
    <SOAP-ENV:Header>
        <ns1:AuthHeader>
            <ns1:login>900413155suc3</ns1:login>
            <ns1:pwd>Emily2006Arley2008</ns1:pwd>
            <ns1:Id_CodFacturacion>SER408</ns1:Id_CodFacturacion>
            <ns1:Nombre_Cargue>FUXION</ns1:Nombre_Cargue>
        </ns1:AuthHeader>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:CargueMasivoExterno>
            <ns1:envios>
                <ns1:CargueMasivoExternoDTO>
                    <ns1:objEnvios>
                        <ns1:EnviosExterno>
                            <ns1:Num_Guia>0</ns1:Num_Guia>
                            <ns1:Num_Sobreporte>0</ns1:Num_Sobreporte>
                            <ns1:Doc_Relacionado></ns1:Doc_Relacionado>
                            <ns1:Num_Piezas>1</ns1:Num_Piezas>
                            <ns1:Des_TipoTrayecto>1</ns1:Des_TipoTrayecto>
                            <ns1:Ide_Producto>2</ns1:Ide_Producto>
                            <ns1:Ide_Destinatarios>00000000-0000-0000-0000-000000000000</ns1:Ide_Destinatarios>
                            <ns1:Ide_Manifiesto>00000000-0000-0000-0000-000000000000</ns1:Ide_Manifiesto>
                            <ns1:Des_FormaPago>2</ns1:Des_FormaPago>
                            <ns1:Des_MedioTransporte>1</ns1:Des_MedioTransporte>
                            <ns1:Num_PesoTotal>3</ns1:Num_PesoTotal>
                            <ns1:Num_ValorDeclaradoTotal>5500</ns1:Num_ValorDeclaradoTotal>
                            <ns1:Num_VolumenTotal>0.5</ns1:Num_VolumenTotal>
                            <ns1:Num_BolsaSeguridad>0</ns1:Num_BolsaSeguridad>
                            <ns1:Num_Precinto>0</ns1:Num_Precinto>
                            <ns1:Des_TipoDuracionTrayecto>1</ns1:Des_TipoDuracionTrayecto>
                            <ns1:Des_Telefono>3333333333</ns1:Des_Telefono>
                            <ns1:Des_Ciudad>Popayan</ns1:Des_Ciudad>
                            <ns1:Des_Direccion>calle 20 #21-14 quintas de girardot</ns1:Des_Direccion>
                            <ns1:Nom_Contacto> LEAL</ns1:Nom_Contacto>
                            <ns1:Des_VlrCampoPersonalizado1></ns1:Des_VlrCampoPersonalizado1>
                            <ns1:Num_ValorLiquidado>0</ns1:Num_ValorLiquidado>
                            <ns1:Des_DiceContener>Indumentaria</ns1:Des_DiceContener>
                            <ns1:Des_TipoGuia>1</ns1:Des_TipoGuia>
                            <ns1:Num_VlrSobreflete>0</ns1:Num_VlrSobreflete>
                            <ns1:Num_VlrFlete>0</ns1:Num_VlrFlete>
                            <ns1:Num_Descuento>0</ns1:Num_Descuento>
                            <ns1:idePaisOrigen>1</ns1:idePaisOrigen>
                            <ns1:idePaisDestino>1</ns1:idePaisDestino>
                            <ns1:Des_IdArchivoOrigen></ns1:Des_IdArchivoOrigen>
                            <ns1:Des_DireccionRemitente></ns1:Des_DireccionRemitente>
                            <ns1:Num_PesoFacturado>0</ns1:Num_PesoFacturado>
                            <ns1:Est_CanalMayorista>false</ns1:Est_CanalMayorista>
                            <ns1:Num_IdentiRemitente></ns1:Num_IdentiRemitente>
                            <ns1:Num_TelefonoRemitente></ns1:Num_TelefonoRemitente>
                            <ns1:Num_Alto>15</ns1:Num_Alto>
                            <ns1:Num_Ancho>20</ns1:Num_Ancho>
                            <ns1:Num_Largo>10</ns1:Num_Largo>
                            <ns1:Des_DepartamentoDestino>Cauca</ns1:Des_DepartamentoDestino>
                            <ns1:Des_DepartamentoOrigen>Cundinamarca</ns1:Des_DepartamentoOrigen>
                            <ns1:Gen_Cajaporte>false</ns1:Gen_Cajaporte>
                            <ns1:Gen_Sobreporte>false</ns1:Gen_Sobreporte>
                            <ns1:Nom_UnidadEmpaque>GENERICA</ns1:Nom_UnidadEmpaque>
                            <ns1:Nom_RemitenteCanal></ns1:Nom_RemitenteCanal>
                            <ns1:Des_UnidadLongitud>cm</ns1:Des_UnidadLongitud>
                            <ns1:Des_UnidadPeso>kg</ns1:Des_UnidadPeso>
                            <ns1:Num_ValorDeclaradoSobreTotal>0</ns1:Num_ValorDeclaradoSobreTotal>
                            <ns1:Num_Factura>723-172153</ns1:Num_Factura>
                            <ns1:Des_CorreoElectronico>jlcapote@misena.edu.co</ns1:Des_CorreoElectronico>
                            <ns1:Est_EnviarCorreo>false</ns1:Est_EnviarCorreo>
                        </ns1:EnviosExterno>
                    </ns1:objEnvios>
                </ns1:CargueMasivoExternoDTO>
            </ns1:envios>
        </ns1:CargueMasivoExterno>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>